app/controllers/registration_controller.rb

SELECT 1 AS one FROM "members" WHERE "members"."email" = 'scott_ruptash@hotmail.com' LIMIT 1
INSERT INTO "members" ("created_at", "email", "encrypted_password", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "contacts" ("address", "mobile") VALUES ($1, $2) RETURNING "id"  [["address", "poo"], ["mobile", "poo"]]
---
	def create

		@member = Member.new
		@member.username = params[:member][:username]
		@member.email = params[:member][:email]
		@member.password = params[:member][:password]
		@member.password_confirmation =params[:member][:password_confirmation]

		@contact = Contact.new
		@contact.mobile = params[:contact][:mobile]
		@contact.address = params[:contact][:address]
		@member.valid?
		if @member.errors.blank?

			@member.save
			#@contact.member = @member
			@contact.save